Диплом_1С_Про/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Диплом_1С_Про/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>КупляПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Диплом_1С_Про/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
//АШ Вывод на форму новых реквизитов договора, если выбран соответствующий вид договора

// @strict-types


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	

		Если Элементы.Найти("ВКМ_ДатаНачалаДействияДоговора") = Неопределено Тогда
			
			НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
			НовыйЭлемент.Заголовок = "Дата начала действия договора";
			НовыйЭлемент.Видимость = Ложь;	
		КонецЕсли;
		
		Если Элементы.Найти("ВКМ_ДатаОкончанияДействияДоговора") = Неопределено Тогда
			
			НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
			НовыйЭлемент.Заголовок = "Дата окончания действия договора";
			НовыйЭлемент.Видимость = Ложь;	
		КонецЕсли;
		
			
		Если Элементы.Найти("ВКМ_СуммаАбонентскойПлаты") = Неопределено Тогда
			
			НовыйЭлемент = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
			НовыйЭлемент.Заголовок = "Сумма абонентской платы";
			НовыйЭлемент.Видимость = Ложь;	
		КонецЕсли;
			
		Если Элементы.Найти("СтоимостьЧасаРаботы") = Неопределено Тогда
			
			НовыйЭлемент = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
			НовыйЭлемент.Заголовок = "Стоимость часа работы";
			НовыйЭлемент.Видимость = Ложь;	
		КонецЕсли;
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
					
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
		Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
			Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Истина;
			Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Истина;
			Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
			Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
			Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
			Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		
		Иначе
			Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Ложь;
			Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Ложь;
			Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
			Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
			
		КонецЕсли;

КонецПроцедуры

#КонецОбласти

//Конец АШ
